Twist/Twist-TAS/servicerequestfiles/ProcessPaymentRequest_FISERV.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:bil="http://b2b.tracfone.com/BillingManagement" xmlns:com="http://www.tracfone.com/rest/model/v1/common">
   <soapenv:Header/>
   <soapenv:Body>
      <bil:processPaymentRequest>
         <com:Header>
            <com:ConsumerInfo>
               <com:name>brandName</com:name>
               <com:Value>WFM</com:Value>
            </com:ConsumerInfo>
            
            <com:ConsumerInfo>
               <com:name>sourceSystem</com:name>
               <com:Value>API</com:Value>
            </com:ConsumerInfo>
           
            <com:ConsumerInfo>
               <com:name>language</com:name>
               <com:Value>ENG</com:Value>
            </com:ConsumerInfo>
            <com:ConsumerInfo>
               <com:name>vendorStore</com:name>
               <com:Value>232</com:Value>
            </com:ConsumerInfo>
            <com:ConsumerInfo>
               <com:name>vendorTerminal</com:name>
               <com:Value>262</com:Value>
            </com:ConsumerInfo>
         </com:Header>
         <com:Payload>
            <com:ID>@ban</com:ID>
            <com:RelatedParty>
               <com:Party>
                  <com:partyID>FISERV</com:partyID>
               </com:Party>
            </com:RelatedParty>
            <com:CustomerPayment>
               <com:amount>@amount</com:amount>
               <com:PaymentMethod>
                  <com:paymentMethodType>CASH</com:paymentMethodType>
               </com:PaymentMethod>
            </com:CustomerPayment>
            <com:CustomerBill>
               <com:CustomerBillExtension>
                  <com:name>receiptNumber</com:name>
                  <com:value>@receipt</com:value>
               </com:CustomerBillExtension>
                <com:CustomerBillExtension>
                  <com:name>paymentDate</com:name>
                  <com:value>@date</com:value>
               </com:CustomerBillExtension>

            </com:CustomerBill>
         </com:Payload>
      </bil:processPaymentRequest>
   </soapenv:Body>
</soapenv:Envelope>
